app/Http/Controllers/AuthController.php

select * from `users` where `admin_code` = '130000' limit 1
---
    public function login_post(Request $request){

        if(!Auth::attempt(['admin_code' =>(integer)$request->admin_code, 'password' =>(string)$request->password])){
            return $this->error('','no such admin',200);
        }
        $remember=0;
        $user = User::where('admin_code',$request->admin_code)->first();